Revit 2027 API
FieldDomainPointsByUV(IList<UV>) Constructor
 Creates object from an array of two-dimensional point coordinates
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldDomainPointsByUV(
	IList<UV> points
)
Public Sub New (
	points As IList(Of UV)
)
public:
FieldDomainPointsByUV(
	IList<UV^>^ points
)
new :
        points : IList<UV> -> FieldDomainPointsByUV
Parameters
points IList<UV>
 Array of two-dimensional point coordinates representing domain points (usually on surface)
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldDomainPointsByUV Class
FieldDomainPointsByUV Overload
Autodesk.Revit.DB.Analysis Namespace